In [1]:
%load_ext sql

In [2]:
# ID와 PW를 자신의 환경에 맞게 수정
%sql postgresql://guest:Guest1!*@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

'Connected: guest@dev'

# 1. 사용자별로 처음 채널과 마지막 채널 알아내기

In [38]:
%%sql

SELECT
  userid, channel,
  LEFT(ts, 7) "month"
FROM raw_data.user_session_channel usc
JOIN raw_data.session_timestamp st ON usc.sessionid = st.sessionid
GROUP BY 1
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
(psycopg2.ProgrammingError) column "usc.channel" must appear in the GROUP BY clause or be used in an aggregate function

[SQL: SELECT
  userid, channel,
  LEFT(ts, 7) "month"
FROM raw_data.user_session_channel usc
JOIN raw_data.session_timestamp st ON usc.sessionid = st.sessionid
GROUP BY 1
LIMIT 10;]
(Background on this error at: http://sqlalche.me/e/14/f405)

In [40]:
%%sql

WITH first AS (
   SELECT userid, ts, channel, ROW_NUMBER() OVER(PARTITION BY userid ORDER BY ts) seq
   FROM raw_data.user_session_channel usc
   JOIN raw_data.session_timestamp st ON usc.sessionid = st.sessionid
), last AS (
   SELECT userid, ts, channel, ROW_NUMBER() OVER(PARTITION BY userid ORDER BY ts DESC) seq
   FROM raw_data.user_session_channel usc
   JOIN raw_data.session_timestamp st ON usc.sessionid = st.sessionid
)   
SELECT first.userid AS userid, first.channel AS first_channel, last.channel AS last_channel
FROM first
JOIN last ON first.userid = last.userid and last.seq = 1
WHERE first.seq = 1
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(27, 'Youtube', 'Instagram'),
 (29, 'Naver', 'Naver'),
 (33, 'Google', 'Youtube'),
 (40, 'Youtube', 'Google'),
 (44, 'Naver', 'Instagram'),
 (59, 'Instagram', 'Instagram'),
 (68, 'Youtube', 'Organic'),
 (87, 'Youtube', 'Google'),
 (97, 'Organic', 'Organic'),
 (113, 'Organic', 'Organic')]

# 2. Gross Revenue가 가장 큰 UserID 10개 찾기

In [8]:
%%sql

SELECT  *
FROM raw_data.user_session_channel use
LEFT JOIN raw_data.session_transaction t ON use.sessionid = t.sessionid
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(80, 'fdc0eb412a84fa549afe68373d9087e9', 'Organic', None, None, None),
 (264, 'a914ecef9c12ffdb9bede64bb703d877', 'Google', None, None, None),
 (229, 'eddeb82df22554fa67c641e3f8a25566', 'Google', None, None, None),
 (80, '8ae1da0fe37c98412768453f82490da2', 'Organic', None, None, None),
 (198, '90f4760fcc9b69c13da7368c5c2917f3', 'Facebook', None, None, None),
 (237, '233f1dd0f3f537bcb7a338ea74d63483', 'Organic', None, None, None),
 (341, 'e10534dd65cf727692c0f9c44ba613f8', 'Naver', 'e10534dd65cf727692c0f9c44ba613f8', False, 126),
 (757, '675f9820626f5bc0afb47b57890b466e', 'Google', None, None, None),
 (786, '569ff987c643b4bedf504efda8f786c2', 'Youtube', None, None, None),
 (661, '567b8f5f423af15818a068235807edc0', 'Naver', None, None, None)]

In [16]:
%%sql

SELECT 
  userid,
  SUM(amount)
FROM raw_data.session_transaction st
LEFT JOIN raw_data.user_session_channel usc ON st.sessionid = usc.sessionid
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(989, 743),
 (772, 556),
 (1615, 506),
 (654, 488),
 (1651, 463),
 (973, 438),
 (262, 422),
 (1099, 421),
 (2682, 414),
 (891, 412)]

# 3. raw_data.nps 테이블을 바탕으로 월별 NPS 계산
* **detractor (비추천자)** : 0 ~ 6
* **passive (소극자)** : 7, 8
* **promoter (홍보자)** : 9, 10
* **NPS** = promoter 퍼센트 - detractor 퍼센트

In [18]:
%%sql

SELECT *
FROM raw_data.nps
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.datetime(2019, 1, 1, 22, 4, 21), 1),
 (datetime.datetime(2019, 1, 3, 19, 31, 41), 10),
 (datetime.datetime(2019, 1, 4, 18, 2, 53), 1),
 (datetime.datetime(2019, 1, 5, 13, 45, 47), 0),
 (datetime.datetime(2019, 1, 5, 22, 36, 38), 6),
 (datetime.datetime(2019, 1, 6, 14, 40, 11), 1),
 (datetime.datetime(2019, 1, 6, 23, 37, 19), 3),
 (datetime.datetime(2019, 1, 7, 14, 40, 17), 3),
 (datetime.datetime(2019, 1, 7, 10, 34, 3), 10),
 (datetime.datetime(2019, 1, 7, 10, 57, 15), 0)]

In [32]:
%%sql

SELECT
  month,
  ROUND((promoter - detractor)*100.0/total, 2) NPS
FROM (
  SELECT
    LEFT(created, 7) "month",
    COUNT(CASE WHEN score >= 9 THEN 1 END) promoter,
    COUNT(CASE WHEN score = 7 or score = 8 THEN 1 END) passive,
    COUNT(CASE WHEN score <= 6 THEN 1 END) detractor,
    COUNT(1) total
  FROM raw_data.nps
  GROUP BY 1
  ORDER BY 1
);

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
12 rows affected.

[('2019-01', Decimal('2.36')),
 ('2019-02', Decimal('30.54')),
 ('2019-03', Decimal('52.91')),
 ('2019-04', Decimal('53.00')),
 ('2019-05', Decimal('54.52')),
 ('2019-06', Decimal('65.02')),
 ('2019-07', Decimal('64.51')),
 ('2019-08', Decimal('67.71')),
 ('2019-09', Decimal('37.95')),
 ('2019-10', Decimal('53.29')),
 ('2019-11', Decimal('61.29')),
 ('2019-12', Decimal('65.99'))]